{"format": "layers-model", "generatedBy": "keras v3.13.1", "convertedBy": "TensorFlow.js Converter v4.22.0", "modelTopology": {"kerasVersion": "3.13.1", "backend": "tensorflow", "modelConfig": {"className": "Functional", "config": {"name": "functional_1", "trainable": true, "layers": [{"className": "InputLayer", "config": {"batchInputShape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_image", "optional": false}, "name": "input_image", "inboundNodes": []}, {"className": "Conv2D", "config": {"name": "Conv1", "trainable": false, "dtype": {"module": "keras", "className": "DTypePolicy", "config": {"name": "float32"}, "registeredName": null}, "filters": 32, "kernelSize": [3, 3], "strides": [2, 2], "padding": "same", "dataFormat": "channels_last", "dilationRate": [1, 1], "groups": 1, "activation": "linear", "useBias": false, "kernelInitializer": {"module": "keras.initializers", "className": "GlorotUniform", "config": {"seed": null}, "registeredName": null}, "biasInitializer": {"module": "keras.initializers", "className": "Zeros", "config": {}, "registeredName": null}, "kernelRegularizer": null, "biasRegularizer": null, "activityRegularizer": null, "kernelConstraint": null, "biasConstraint": null}, "name": "Conv1", "inboundNodes": [{"args": [{"className": "__keras_tensor__", "config": {"shape": [null, 224, 224, 3], "dtype": "float32", "kerasHistory": ["input_image", 0, 0]}}], "kwargs": {}}]}, {"className": "BatchNormalization", "config": {"name": "bn_Conv1", "trainable": false, "dtype": {"module": "keras", "className": "DTypePolicy", "config": {"name": "float32"}, "registeredName": null}, "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "betaInitializer": {"module": "keras.initializers", "className": "Zeros", "config": {}, "registeredName": null}, "gammaInitializer": {"module": "keras.initializers", "className": "Ones", "config": {}, "registeredName": null}, "movingMeanInitializer": {"module": "keras.initializers", "className": "Zeros", "config": {}, "registeredName": null}, "movingVarianceInitializer": {"module": "keras.initializers", "className": "Ones", "config": {}, "registeredName": null}, "betaRegularizer": null, "gammaRegularizer": null, "betaConstraint": null, "gammaConstraint": null, "synchronized": false}, "name": "bn_Conv1", "inboundNodes": [{"args": [{"className": "__keras_tensor__", "config": {"shape": [null, 112, 112, 32], "dtype": "float32", "kerasHistory": ["Conv1", 0, 0]}}], "kwargs": {"mask": null}}]}, {"className": "ReLU", "config": {"name": "Conv1_relu", "trainable": false, "dtype": {"module": "keras", "className": "DTypePolicy", "config": {"name": "float32"}, "registeredName": null}, "maxValue": 6.0, "negativeSlope": 0.0, "threshold": 0.0}, "name": "Conv1_relu", "inboundNodes": [{"args": [{"className": "__keras_tensor__", "config": {"shape": [null, 112, 112, 32], "dtype": "float32", "kerasHistory": ["bn_Conv1", 0, 0]}}], "kwargs": {}}]}, {"className": "DepthwiseConv2D", "config": {"name": "expanded_conv_depthwise", "trainable": false, "dtype": {"module": "keras", "className": "DTypePolicy", "config": {"name": "float32"}, "registeredName": null}, "depthMultiplier": 1, "kernelSize": [3, 3], "strides": [1, 1], "padding": "same", "dataFormat": "channels_last", "dilationRate": [1, 1], "activation": "linear", "useBias": false, "depthwiseInitializer": {"module": "keras.initializers", "className": "GlorotUniform", "config": {"seed": null}, "registeredName": null}, "biasInitializer": {"module": "keras.initializers", "className": "Zeros", "config": {}, "registeredName": null}, "depthwiseRegularizer": null, "biasRegularizer": null, "activityRegularizer": null, "depthwiseConstraint": null, "biasConstraint": null}, "name": "expanded_conv_depthwise", "inboundNodes": [{"args": [{"className": "__keras_tensor__", "config": {"shape": [null, 112, 112, 32], "dtype": "float32", "kerasHistory": ["Conv1_relu", 0, 0]}}], "kwargs": {}}]}, {"className": "BatchNormalization", "config": {"name": "expanded_conv_depthwise_BN", "trainable": false, "dtype": {"module": "keras", "className": "DTypePolicy", "config": {"name": "float32"}, "registeredName": null}, "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "betaInitializer": {"module": "keras.initializers", "className": "Zeros", "config": {}, "registeredName": null}, "gammaInitializer": {"module": "keras.initializers", "className": "Ones", "config": {}, "registeredName": null}, "movingMeanInitializer": {"module": "keras.initializers", "className": "Zeros", "config": {}, "registeredName": null}, "movingVarianceInitializer": {"module": "keras.initializers", "className": "Ones", "config": {}, "registeredName": null}, "betaRegularizer": null, "gammaRegularizer": null, "betaConstraint": null, "gammaConstraint": null, "synchronized": false}, "name": "expanded_conv_depthwise_BN", "inboundNodes": [{"args": [{"className": "__keras_tensor__", "config": {"shape": [null, 112, 112, 32], "dtype": "float32", "kerasHistory": ["expanded_conv_depthwise", 0, 0]}}], "kwargs": {"mask": null}}]}, {"className": "ReLU", "config": {"name": "expanded_conv_depthwise_relu", "trainable": false, "dtype": {"module": "keras", "className": "DTypePolicy", "config": {"name": "float32"}, "registeredName": null}, "maxValue": 6.0, "negativeSlope": 0.0, "threshold": 0.0}, "name": "expanded_conv_depthwise_relu", "inboundNodes": [{"args": [{"className": "__keras_tensor__", "config": {"shape": [null, 112, 112, 32], "dtype": "float32", "kerasHistory": ["expanded_conv_depthwise_BN", 0, 0]}}], "kwargs": {}}]}, {"className": "Conv2D", "config": {"name": "expanded_conv_project", "trainable": false, "dtype": {"module": "keras", "className": "DTypePolicy", "config": {"name": "float32"}, "registeredName": null}, "filters": 16, "kernelSize": [1, 1], "strides": [1, 1], "padding": "same", "dataFormat": "channels_last", "dilationRate": [1, 1], "groups": 1, "activation": "linear", "useBias": false, "kernelInitializer": {"module": "keras.initializers", "className": "GlorotUniform", "config": {"seed": null}, "registeredName": null}, "biasInitializer": {"module": "keras.initializers", "className": "Zeros", "config": {}, "registeredName": null}, "kernelRegularizer": null, "biasRegularizer": null, "activityRegularizer": null, "kernelConstraint": null, "biasConstraint": null}, "name": "expanded_conv_project", "inboundNodes": [{"args": [{"className": "__keras_tensor__", "config": {"shape": [null, 112, 112, 32], "dtype": "float32", "kerasHistory": ["expanded_conv_depthwise_relu", 0, 0]}}], "kwargs": {}}]}, {"className": "BatchNormalization", "config": {"name": "expanded_conv_project_BN", "trainable": false, "dtype": {"module": "keras", "className": "DTypePolicy", "config": {"name": "float32"}, "registeredName": null}, "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "betaInitializer": {"module": "keras.initializers", "className": "Zeros", "config": {}, "registeredName": null}, "gammaInitializer": {"module": "keras.initializers", "className": "Ones", "config": {}, "registeredName": null}, "movingMeanInitializer": {"module": "keras.initializers", "className": "Zeros", "config": {}, "registeredName": null}, "movingVarianceInitializer": {"module": "keras.initializers", "className": "Ones", "config": {}, "registeredName": null}, "betaRegularizer": null, "gammaRegularizer": null, "betaConstraint": null, "gammaConstraint": null, "synchronized": false}, "name": "expanded_conv_project_BN", "inboundNodes": [{"args": [{"className": "__keras_tensor__", "config": {"shape": [null, 112, 112, 16], "dtype": "float32", "kerasHistory": ["expanded_conv_project", 0, 0]}}], "kwargs": {"mask": null}}]}, {"className": "Conv2D", "config": {"name": "block_1_expand", "trainable": false, "dtype": {"module": "keras", "className": "DTypePolicy", "config": {"name": "float32"}, "registeredName": null}, "filters": 96, "kernelSize": [1, 1], "strides": [1, 1], "padding": "same", "dataFormat": "channels_last", "dilationRate": [1, 1], "groups": 1, "activation": "linear", "useBias": false, "kernelInitializer": {"module": "keras.initializers", "className": "GlorotUniform", "config": {"seed": null}, "registeredName": null}, "biasInitializer": {"module": "keras.initializers", "className": "Zeros", "config": {}, "registeredName": null}, "kernelRegularizer": null, "biasRegularizer": null, "activityRegularizer": null, "kernelConstraint": null, "biasConstraint": null}, "name": "block_1_expand", "inboundNodes": [{"args": [{"className": "__keras_tensor__", "config": {"shape": [null, 112, 112, 16], "dtype": "float32", "kerasHistory": ["expanded_conv_project_BN", 0, 0]}}], "kwargs": {}}]}, {"className": "BatchNormalization", "config": {"name": "block_1_expand_BN", "trainable": false, "dtype": {"module": "keras", "className": "DTypePolicy", "config": {"name": "float32"}, "registeredName": null}, "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "betaInitializer": {"module": "keras.initializers", "className": "Zeros", "config": {}, "registeredName": null}, "gammaInitializer": {"module": "keras.initializers", "className": "Ones", "config": {}, "registeredName": null}, "movingMeanInitializer": {"module": "keras.initializers", "className": "Zeros", "config": {}, "registeredName": null}, "movingVarianceInitializer": {"module": "keras.initializers", "className": "Ones", "config": {}, "registeredName": null}, "betaRegularizer": null, "gammaRegularizer": null, "betaConstraint": null, "gammaConstraint": null, "synchronized": false}, "name": "block_1_expand_BN", "inboundNodes": [{"args": [{"className": "__keras_tensor__", "config": {"shape": [null, 112, 112, 96], "dtype": "float32", "kerasHistory": ["block_1_expand", 0, 0]}}], "kwargs": {"mask": null}}]}, {"className": "ReLU", "config": {"name": "block_1_expand_relu", "trainable": false, "dtype": {"module": "keras", "className": "DTypePolicy", "config": {"name": "float32"}, "registeredName": null}, "maxValue": 6.0, "negativeSlope": 0.0, "threshold": 0.0}, "name": "block_1_expand_relu", "inboundNodes": [{"args": [{"className": "__keras_tensor__", "config": {"shape": [null, 112, 112, 96], "dtype": "float32", "kerasHistory": ["block_1_expand_BN", 0, 0]}}], "kwargs": {}}]}, {"className": "ZeroPadding2D", "config": {"name": "block_1_pad", "trainable": false, "dtype": {"module": "keras", "className": "DTypePolicy", "config": {"name": "float32"}, "registeredName": null}, "padding": [[0, 1], [0, 1]], "dataFormat": "channels_last"}, "name": "block_1_pad", "inboundNodes": [{"args": [{"className": "__keras_tensor__", "config": {"shape": [null, 112, 112, 96], "dtype": "float32", "kerasHistory": ["block_1_expand_relu", 0, 0]}}], "kwargs": {}}]}, {"className": "DepthwiseConv2D", "config": {"name": "block_1_depthwise", "trainable": false, "dtype": {"module": "keras", "className": "DTypePolicy", "config": {"name": "float32"}, "registeredName": null}, "depthMultiplier": 1, "kernelSize": [3, 3], "strides": [2, 2], "padding": "valid", "dataFormat": "channels_last", "dilationRate": [1, 1], "activation": "linear", "useBias": false, "depthwiseInitializer": {"module": "keras.initializers", "className": "GlorotUniform", "config": {"seed": null}, "registeredName": null}, "biasInitializer": {"module": "keras.initializers", "className": "Zeros", "config": {}, "registeredName": null}, "depthwiseRegularizer": null, "biasRegularizer": null, "activityRegularizer": null, "depthwiseConstraint": null, "biasConstraint": null}, "name": "block_1_depthwise", "inboundNodes": [{"args": [{"className": "__keras_tensor__", "config": {"shape": [null, 113, 113, 96], "dtype": "float32", "kerasHistory": ["block_1_pad", 0, 0]}}], "kwargs": {}}]}, {"className": "BatchNormalization", "config": {"name": "block_1_depthwise_BN", "trainable": false, "dtype": {"module": "keras", "className": "DTypePolicy", "config": {"name": "float32"}, "registeredName": null}, "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "betaInitializer": {"module": "keras.initializers", "className": "Zeros", "config": {}, "registeredName": null}, "gammaInitializer": {"module": "keras.initializers", "className": "Ones", "config": {}, "registeredName": null}, "movingMeanInitializer": {"module": "keras.initializers", "className": "Zeros", "config": {}, "registeredName": null}, "movingVarianceInitializer": {"module": "keras.initializers", "className": "Ones", "config": {}, "registeredName": null}, "betaRegularizer": null, "gammaRegularizer": null, "betaConstraint": null, "gammaConstraint": null, "synchronized": false}, "name": "block_1_depthwise_BN", "inboundNodes": [{"args": [{"className": "__keras_tensor__", "config": {"shape": [null, 56, 56, 96], "dtype": "float32", "kerasHistory": ["block_1_depthwise", 0, 0]}}], "kwargs": {"mask": null}}]}, {"className": "ReLU", "config": {"name": "block_1_depthwise_relu", "trainable": false, "dtype": {"module": "keras", "className": "DTypePolicy", "config": {"name": "float32"}, "registeredName": null}, "maxValue": 6.0, "negativeSlope": 0.0, "threshold": 0.0}, "name": "block_1_depthwise_relu", "inboundNodes": [{"args": [{"className": "__keras_tensor__", "config": {"shape": [null, 56, 56, 96], "dtype": "float32", "kerasHistory": ["block_1_depthwise_BN", 0, 0]}}], "kwargs": {}}]}, {"className": "Conv2D", "config": {"name": "block_1_project", "trainable": false, "dtype": {"module": "keras", "className": "DTypePolicy", "config": {"name": "float32"}, "registeredName": null}, "filters": 24, "kernelSize": [1, 1], "strides": [1, 1], "padding": "same", "dataFormat": "channels_last", "dilationRate": [1, 1], "groups": 1, "activation": "linear", "useBias": false, "kernelInitializer": {"module": "keras.initializers", "className": "GlorotUniform", "config": {"seed": null}, "registeredName": null}, "biasInitializer": {"module": "keras.initializers", "className": "Zeros", "config": {}, "registeredName": null}, "kernelRegularizer": null, "biasRegularizer": null, "activityRegularizer": null, "kernelConstraint": null, "biasConstraint": null}, "name": "block_1_project", "inboundNodes": [{"args": [{"className": "__keras_tensor__", "config": {"shape": [null, 56, 56, 96], "dtype": "float32", "kerasHistory": ["block_1_depthwise_relu", 0, 0]}}], "kwargs": {}}]}, {"className": "BatchNormalization", "config": {"name": "block_1_project_BN", "trainable": false, "dtype": {"module": "keras", "className": "DTypePolicy", "config": {"name": "float32"}, "registeredName": null}, "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "betaInitializer": {"module": "keras.initializers", "className": "Zeros", "config": {}, "registeredName": null}, "gammaInitializer": {"module": "keras.initializers", "className": "Ones", "config": {}, "registeredName": null}, "movingMeanInitializer": {"module": "keras.initializers", "className": "Zeros", "config": {}, "registeredName": null}, "movingVarianceInitializer": {"module": "keras.initializers", "className": "Ones", "config": {}, "registeredName": null}, "betaRegularizer": null, "gammaRegularizer": null, "betaConstraint": null, "gammaConstraint": null, "synchronized": false}, "name": "block_1_project_BN", "inboundNodes": [{"args": [{"className": "__keras_tensor__", "config": {"shape": [null, 56, 56, 24], "dtype": "float32", "kerasHistory": ["block_1_project", 0, 0]}}], "kwargs": {"mask": null}}]}, {"className": "Conv2D", "config": {"name": "block_2_expand", "trainable": false, "dtype": {"module": "keras", "className": "DTypePolicy", "config": {"name": "float32"}, "registeredName": null}, "filters": 144, "kernelSize": [1, 1], "strides": [1, 1], "padding": "same", "dataFormat": "channels_last", "dilationRate": [1, 1], "groups": 1, "activation": "linear", "useBias": false, "kernelInitializer": {"module": "keras.initializers", "className": "GlorotUniform", "config": {"seed": null}, "registeredName": null}, "biasInitializer": {"module": "keras.initializers", "className": "Zeros", "config": {}, "registeredName": null}, "kernelRegularizer": null, "biasRegularizer": null, "activityRegularizer": null, "kernelConstraint": null, "biasConstraint": null}, "name": "block_2_expand", "inboundNodes": [{"args": [{"className": "__keras_tensor__", "config": {"shape": [null, 56, 56, 24], "dtype": "float32", "kerasHistory": ["block_1_project_BN", 0, 0]}}], "kwargs": {}}]}, {"className": "BatchNormalization", "config": {"name": "block_2_expand_BN", "trainable": false, "dtype": {"module": "keras", "className": "DTypePolicy", "config": {"name": "float32"}, "registeredName": null}, "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "betaInitializer": {"module": "keras.initializers", "className": "Zeros", "config": {}, "registeredName": null}, "gammaInitializer": {"module": "keras.initializers", "className": "Ones", "config": {}, "registeredName": null}, "movingMeanInitializer": {"module": "keras.initializers", "className": "Zeros", "config": {}, "registeredName": null}, "movingVarianceInitializer": {"module": "keras.initializers", "className": "Ones", "config": {}, "registeredName": null}, "betaRegularizer": null, "gammaRegularizer": null, "betaConstraint": null, "gammaConstraint": null, "synchronized": false}, "name": "block_2_expand_BN", "inboundNodes": [{"args": [{"className": "__keras_tensor__", "config": {"shape": [null, 56, 56, 144], "dtype": "float32", "kerasHistory": ["block_2_expand", 0, 0]}}], "kwargs": {"mask": null}}]}, {"className": "ReLU", "config": {"name": "block_2_expand_relu", "trainable": false, "dtype": {"module": "keras", "className": "DTypePolicy", "config": {"name": "float32"}, "registeredName": null}, "maxValue": 6.0, "negativeSlope": 0.0, "threshold": 0.0}, "name": "block_2_expand_relu", "inboundNodes": [{"args": [{"className": "__keras_tensor__", "config": {"shape": [null, 56, 56, 144], "dtype": "float32", "kerasHistory": ["block_2_expand_BN", 0, 0]}}], "kwargs": {}}]}, {"className": "DepthwiseConv2D", "config": {"name": "block_2_depthwise", "trainable": false, "dtype": {"module": "keras", "className": "DTypePolicy", "config": {"name": "float32"}, "registeredName": null}, "depthMultiplier": 1, "kernelSize": [3, 3], "strides": [1, 1], "padding": "same", "dataFormat": "channels_last", "dilationRate": [1, 1], "activation": "linear", "useBias": false, "depthwiseInitializer": {"module": "keras.initializers", "className": "GlorotUniform", "config": {"seed": null}, "registeredName": null}, "biasInitializer": {"module": "keras.initializers", "className": "Zeros", "config": {}, "registeredName": null}, "depthwiseRegularizer": null, "biasRegularizer": null, "activityRegularizer": null, "depthwiseConstraint": null, "biasConstraint": null}, "name": "block_2_depthwise", "inboundNodes": [{"args": [{"className": "__keras_tensor__", "config": {"shape": [null, 56, 56, 144], "dtype": "float32", "kerasHistory": ["block_2_expand_relu", 0, 0]}}], "kwargs": {}}]}, {"className": "BatchNormalization", "config": {"name": "block_2_depthwise_BN", "trainable": false, "dtype": {"module": "keras", "className": "DTypePolicy", "config": {"name": "float32"}, "registeredName": null}, "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "betaInitializer": {"module": "keras.initializers", "className": "Zeros", "config": {}, "registeredName": null}, "gammaInitializer": {"module": "keras.initializers", "className": "Ones", "config": {}, "registeredName": null}, "movingMeanInitializer": {"module": "keras.initializers", "className": "Zeros", "config": {}, "registeredName": null}, "movingVarianceInitializer": {"module": "keras.initializers", "className": "Ones", "config": {}, "registeredName": null}, "betaRegularizer": null, "gammaRegularizer": null, "betaConstraint": null, "gammaConstraint": null, "synchronized": false}, "name": "block_2_depthwise_BN", "inboundNodes": [{"args": [{"className": "__keras_tensor__", "config": {"shape": [null, 56, 56, 144], "dtype": "float32", "kerasHistory": ["block_2_depthwise", 0, 0]}}], "kwargs": {"mask": null}}]}, {"className": "ReLU", "config": {"name": "block_2_depthwise_relu", "trainable": false, "dtype": {"module": "keras", "className": "DTypePolicy", "config": {"name": "float32"}, "registeredName": null}, "maxValue": 6.0, "negativeSlope": 0.0, "threshold": 0.0}, "name": "block_2_depthwise_relu", "inboundNodes": [{"args": [{"className": "__keras_tensor__", "config": {"shape": [null, 56, 56, 144], "dtype": "float32", "kerasHistory": ["block_2_depthwise_BN", 0, 0]}}], "kwargs": {}}]}, {"className": "Conv2D", "config": {"name": "block_2_project", "trainable": false, "dtype": {"module": "keras", "className": "DTypePolicy", "config": {"name": "float32"}, "registeredName": null}, "filters": 24, "kernelSize": [1, 1], "strides": [1, 1], "padding": "same", "dataFormat": "channels_last", "dilationRate": [1, 1], "groups": 1, "activation": "linear", "useBias": false, "kernelInitializer": {"module": "keras.initializers", "className": "GlorotUniform", "config": {"seed": null}, "registeredName": null}, "biasInitializer": {"module": "keras.initializers", "className": "Zeros", "config": {}, "registeredName": null}, "kernelRegularizer": null, "biasRegularizer": null, "activityRegularizer": null, "kernelConstraint": null, "biasConstraint": null}, "name": "block_2_project", "inboundNodes": [{"args": [{"className": "__keras_tensor__", "config": {"shape": [null, 56, 56, 144], "dtype": "float32", "kerasHistory": ["block_2_depthwise_relu", 0, 0]}}], "kwargs": {}}]}, {"className": "BatchNormalization", "config": {"name": "block_2_project_BN", "trainable": false, "dtype": {"module": "keras", "className": "DTypePolicy", "config": {"name": "float32"}, "registeredName": null}, "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "betaInitializer": {"module": "keras.initializers", "className": "Zeros", "config": {}, "registeredName": null}, "gammaInitializer": {"module": "keras.initializers", "className": "Ones", "config": {}, "registeredName": null}, "movingMeanInitializer": {"module": "keras.initializers", "className": "Zeros", "config": {}, "registeredName": null}, "movingVarianceInitializer": {"module": "keras.initializers", "className": "Ones", "config": {}, "registeredName": null}, "betaRegularizer": null, "gammaRegularizer": null, "betaConstraint": null, "gammaConstraint": null, "synchronized": false}, "name": "block_2_project_BN", "inboundNodes": [{"args": [{"className": "__keras_tensor__", "config": {"shape": [null, 56, 56, 24], "dtype": "float32", "kerasHistory": ["block_2_project", 0, 0]}}], "kwargs": {"mask": null}}]}, {"className": "Add", "config": {"name": "block_2_add", "trainable": false, "dtype": {"module": "keras", "className": "DTypePolicy", "config": {"name": "float32"}, "registeredName": null}}, "name": "block_2_add", "inboundNodes": [{"args": [[{"className": "__keras_tensor__", "config": {"shape": [null, 56, 56, 24], "dtype": "float32", "kerasHistory": ["block_1_project_BN", 0, 0]}}, {"className": "__keras_tensor__", "config": {"shape": [null, 56, 56, 24], "dtype": "float32", "kerasHistory": ["block_2_project_BN", 0, 0]}}]], "kwargs": {}}]}, {"className": "Conv2D", "config": {"name": "block_3_expand", "trainable": false, "dtype": {"module": "keras", "className": "DTypePolicy", "config": {"name": "float32"}, "registeredName": null}, "filters": 144, "kernelSize": [1, 1], "strides": [1, 1], "padding": "same", "dataFormat": "channels_last", "dilationRate": [1, 1], "groups": 1, "activation": "linear", "useBias": false, "kernelInitializer": {"module": "keras.initializers", "className": "GlorotUniform", "config": {"seed": null}, "registeredName": null}, "biasInitializer": {"module": "keras.initializers", "className": "Zeros", "config": {}, "registeredName": null}, "kernelRegularizer": null, "biasRegularizer": null, "activityRegularizer": null, "kernelConstraint": null, "biasConstraint": null}, "name": "block_3_expand", "inboundNodes": [{"args": [{"className": "__keras_tensor__", "config": {"shape": [null, 56, 56, 24], "dtype": "float32", "kerasHistory": ["block_2_add", 0, 0]}}], "kwargs": {}}]}, {"className": "BatchNormalization", "config": {"name": "block_3_expand_BN", "trainable": false, "dtype": {"module": "keras", "className": "DTypePolicy", "config": {"name": "float32"}, "registeredName": null}, "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "betaInitializer": {"module": "keras.initializers", "className": "Zeros", "config": {}, "registeredName": null}, "gammaInitializer": {"module": "keras.initializers", "className": "Ones", "config": {}, "registeredName": null}, "movingMeanInitializer": {"module": "keras.initializers", "className": "Zeros", "config": {}, "registeredName": null}, "movingVarianceInitializer": {"module": "keras.initializers", "className": "Ones", "config": {}, "registeredName": null}, "betaRegularizer": null, "gammaRegularizer": null, "betaConstraint": null, "gammaConstraint": null, "synchronized": false}, "name": "block_3_expand_BN", "inboundNodes": [{"args": [{"className": "__keras_tensor__", "config": {"shape": [null, 56, 56, 144], "dtype": "float32", "kerasHistory": ["block_3_expand", 0, 0]}}], "kwargs": {"mask": null}}]}, {"className": "ReLU", "config": {"name": "block_3_expand_relu", "trainable": false, "dtype": {"module": "keras", "className": "DTypePolicy", "config": {"name": "float32"}, "registeredName": null}, "maxValue": 6.0, "negativeSlope": 0.0, "threshold": 0.0}, "name": "block_3_expand_relu", "inboundNodes": [{"args": [{"className": "__keras_tensor__", "config": {"shape": [null, 56, 56, 144], "dtype": "float32", "kerasHistory": ["block_3_expand_BN", 0, 0]}}], "kwargs": {}}]}, {"className": "ZeroPadding2D", "config": {"name": "block_3_pad", "trainable": false, "dtype": {"module": "keras", "className": "DTypePolicy", "config": {"name": "float32"}, "registeredName": null}, "padding": [[0, 1], [0, 1]], "dataFormat": "channels_last"}, "name": "block_3_pad", "inboundNodes": [{"args": [{"className": "__keras_tensor__", "config": {"shape": [null, 56, 56, 144], "dtype": "float32", "kerasHistory": ["block_3_expand_relu", 0, 0]}}], "kwargs": {}}]}, {"className": "DepthwiseConv2D", "config": {"name": "block_3_depthwise", "trainable": false, "dtype": {"module": "keras", "className": "DTypePolicy", "config": {"name": "float32"}, "registeredName": null}, "depthMultiplier": 1, "kernelSize": [3, 3], "strides": [2, 2], "padding": "valid", "dataFormat": "channels_last", "dilationRate": [1, 1], "activation": "linear", "useBias": false, "depthwiseInitializer": {"module": "keras.initializers", "className": "GlorotUniform", "config": {"seed": null}, "registeredName": null}, "biasInitializer": {"module": "keras.initializers", "className": "Zeros", "config": {}, "registeredName": null}, "depthwiseRegularizer": null, "biasRegularizer": null, "activityRegularizer": null, "depthwiseConstraint": null, "biasConstraint": null}, "name": "block_3_depthwise", "inboundNodes": [{"args": [{"className": "__keras_tensor__", "config": {"shape": [null, 57, 57, 144], "dtype": "float32", "kerasHistory": ["block_3_pad", 0, 0]}}], "kwargs": {}}]}, {"className": "BatchNormalization", "config": {"name": "block_3_depthwise_BN", "trainable": false, "dtype": {"module": "keras", "className": "DTypePolicy", "config": {"name": "float32"}, "registeredName": null}, "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "betaInitializer": {"module": "keras.initializers", "className": "Zeros", "config": {}, "registeredName": null}, "gammaInitializer": {"module": "keras.initializers", "className": "Ones", "config": {}, "registeredName": null}, "movingMeanInitializer": {"module": "keras.initializers", "className": "Zeros", "config": {}, "registeredName": null}, "movingVarianceInitializer": {"module": "keras.initializers", "className": "Ones", "config": {}, "registeredName": null}, "betaRegularizer": null, "gammaRegularizer": null, "betaConstraint": null, "gammaConstraint": null, "synchronized": false}, "name": "block_3_depthwise_BN", "inboundNodes": [{"args": [{"className": "__keras_tensor__", "config": {"shape": [null, 28, 28, 144], "dtype": "float32", "kerasHistory": ["block_3_depthwise", 0, 0]}}], "kwargs": {"mask": null}}]}, {"className": "ReLU", "config": {"name": "block_3_depthwise_relu", "trainable": false, "dtype": {"module": "keras", "className": "DTypePolicy", "config": {"name": "float32"}, "registeredName": null}, "maxValue": 6.0, "negativeSlope": 0.0, "threshold": 0.0}, "name": "block_3_depthwise_relu", "inboundNodes": [{"args": [{"className": "__keras_tensor__", "config": {"shape": [null, 28, 28, 144], "dtype": "float32", "kerasHistory": ["block_3_depthwise_BN", 0, 0]}}], "kwargs": {}}]}, {"className": "Conv2D", "config": {"name": "block_3_project", "trainable": false, "dtype": {"module": "keras", "className": "DTypePolicy", "config": {"name": "float32"}, "registeredName": null}, "filters": 32, "kernelSize": [1, 1], "strides": [1, 1], "padding": "same", "dataFormat": "channels_last", "dilationRate": [1, 1], "groups": 1, "activation": "linear", "useBias": false, "kernelInitializer": {"module": "keras.initializers", "className": "GlorotUniform", "config": {"seed": null}, "registeredName": null}, "biasInitializer": {"module": "keras.initializers", "className": "Zeros", "config": {}, "registeredName": null}, "kernelRegularizer": null, "biasRegularizer": null, "activityRegularizer": null, "kernelConstraint": null, "biasConstraint": null}, "name": "block_3_project", "inboundNodes": [{"args": [{"className": "__keras_tensor__", "config": {"shape": [null, 28, 28, 144], "dtype": "float32", "kerasHistory": ["block_3_depthwise_relu", 0, 0]}}], "kwargs": {}}]}, {"className": "BatchNormalization", "config": {"name": "block_3_project_BN", "trainable": false, "dtype": {"module": "keras", "className": "DTypePolicy", "config": {"name": "float32"}, "registeredName": null}, "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "betaInitializer": {"module": "keras.initializers", "className": "Zeros", "config": {}, "registeredName": null}, "gammaInitializer": {"module": "keras.initializers", "className": "Ones", "config": {}, "registeredName": null}, "movingMeanInitializer": {"module": "keras.initializers", "className": "Zeros", "config": {}, "registeredName": null}, "movingVarianceInitializer": {"module": "keras.initializers", "className": "Ones", "config": {}, "registeredName": null}, "betaRegularizer": null, "gammaRegularizer": null, "betaConstraint": null, "gammaConstraint": null, "synchronized": false}, "name": "block_3_project_BN", "inboundNodes": [{"args": [{"className": "__keras_tensor__", "config": {"shape": [null, 28, 28, 32], "dtype": "float32", "kerasHistory": ["block_3_project", 0, 0]}}], "kwargs": {"mask": null}}]}, {"className": "Conv2D", "config": {"name": "block_4_expand", "trainable": false, "dtype": {"module": "keras", "className": "DTypePolicy", "config": {"name": "float32"}, "registeredName": null}, "filters": 192, "kernelSize": [1, 1], "strides": [1, 1], "padding": "same", "dataFormat": "channels_last", "dilationRate": [1, 1], "groups": 1, "activation": "linear", "useBias": false, "kernelInitializer": {"module": "keras.initializers", "className": "GlorotUniform", "config": {"seed": null}, "registeredName": null}, "biasInitializer": {"module": "keras.initializers", "className": "Zeros", "config": {}, "registeredName": null}, "kernelRegularizer": null, "biasRegularizer": null, "activityRegularizer": null, "kernelConstraint": null, "biasConstraint": null}, "name": "block_4_expand", "inboundNodes": [{"args": [{"className": "__keras_tensor__", "config": {"shape": [null, 28, 28, 32], "dtype": "float32", "kerasHistory": ["block_3_project_BN", 0, 0]}}], "kwargs": {}}]}, {"className": "BatchNormalization", "config": {"name": "block_4_expand_BN", "trainable": false, "dtype": {"module": "keras", "className": "DTypePolicy", "config": {"name": "float32"}, "registeredName": null}, "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "betaInitializer": {"module": "keras.initializers", "className": "Zeros", "config": {}, "registeredName": null}, "gammaInitializer": {"module": "keras.initializers", "className": "Ones", "config": {}, "registeredName": null}, "movingMeanInitializer": {"module": "keras.initializers", "className": "Zeros", "config": {}, "registeredName": null}, "movingVarianceInitializer": {"module": "keras.initializers", "className": "Ones", "config": {}, "registeredName": null}, "betaRegularizer": null, "gammaRegularizer": null, "betaConstraint": null, "gammaConstraint": null, "synchronized": false}, "name": "block_4_expand_BN", "inboundNodes": [{"args": [{"className": "__keras_tensor__", "config": {"shape": [null, 28, 28, 192], "dtype": "float32", "kerasHistory": ["block_4_expand", 0, 0]}}], "kwargs": {"mask": null}}]}, {"className": "ReLU", "config": {"name": "block_4_expand_relu", "trainable": false, "dtype": {"module": "keras", "className": "DTypePolicy", "config": {"name": "float32"}, "registeredName": null}, "maxValue": 6.0, "negativeSlope": 0.0, "threshold": 0.0}, "name": "block_4_expand_relu", "inboundNodes": [{"args": [{"className": "__keras_tensor__", "config": {"shape": [null, 28, 28, 192], "dtype": "float32", "kerasHistory": ["block_4_expand_BN", 0, 0]}}], "kwargs": {}}]}, {"className": "DepthwiseConv2D", "config": {"name": "block_4_depthwise", "trainable": false, "dtype": {"module": "keras", "className": "DTypePolicy", "config": {"name": "float32"}, "registeredName": null}, "depthMultiplier": 1, "kernelSize": [3, 3], "strides": [1, 1], "padding": "same", "dataFormat": "channels_last", "dilationRate": [1, 1], "activation": "linear", "useBias": false, "depthwiseInitializer": {"module": "keras.initializers", "className": "GlorotUniform", "config": {"seed": null}, "registeredName": null}, "biasInitializer": {"module": "keras.initializers", "className": "Zeros", "config": {}, "registeredName": null}, "depthwiseRegularizer": null, "biasRegularizer": null, "activityRegularizer": null, "depthwiseConstraint": null, "biasConstraint": null}, "name": "block_4_depthwise", "inboundNodes": [{"args": [{"className": "__keras_tensor__", "config": {"shape": [null, 28, 28, 192], "dtype": "float32", "kerasHistory": ["block_4_expand_relu", 0, 0]}}], "kwargs": {}}]}, {"className": "BatchNormalization", "config": {"name": "block_4_depthwise_BN", "trainable": false, "dtype": {"module": "keras", "className": "DTypePolicy", "config": {"name": "float32"}, "registeredName": null}, "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "betaInitializer": {"module": "keras.initializers", "className": "Zeros", "config": {}, "registeredName": null}, "gammaInitializer": {"module": "keras.initializers", "className": "Ones", "config": {}, "registeredName": null}, "movingMeanInitializer": {"module": "keras.initializers", "className": "Zeros", "config": {}, "registeredName": null}, "movingVarianceInitializer": {"module": "keras.initializers", "className": "Ones", "config": {}, "registeredName": null}, "betaRegularizer": null, "gammaRegularizer": null, "betaConstraint": null, "gammaConstraint": null, "synchronized": false}, "name": "block_4_depthwise_BN", "inboundNodes": [{"args": [{"className": "__keras_tensor__", "config": {"shape": [null, 28, 28, 192], "dtype": "float32", "kerasHistory": ["block_4_depthwise", 0, 0]}}], "kwargs": {"mask": null}}]}, {"className": "ReLU", "config": {"name": "block_4_depthwise_relu", "trainable": false, "dtype": {"module": "keras", "className": "DTypePolicy", "config": {"name": "float32"}, "registeredName": null}, "maxValue": 6.0, "negativeSlope": 0.0, "threshold": 0.0}, "name": "block_4_depthwise_relu", "inboundNodes": [{"args": [{"className": "__keras_tensor__", "config": {"shape": [null, 28, 28, 192], "dtype": "float32", "kerasHistory": ["block_4_depthwise_BN", 0, 0]}}], "kwargs": {}}]}, {"className": "Conv2D", "config": {"name": "block_4_project", "trainable": false, "dtype": {"module": "keras", "className": "DTypePolicy", "config": {"name": "float32"}, "registeredName": null}, "filters": 32, "kernelSize": [1, 1], "strides": [1, 1], "padding": "same", "dataFormat": "channels_last", "dilationRate": [1, 1], "groups": 1, "activation": "linear", "useBias": false, "kernelInitializer": {"module": "keras.initializers", "className": "GlorotUniform", "config": {"seed": null}, "registeredName": null}, "biasInitializer": {"module": "keras.initializers", "className": "Zeros", "config": {}, "registeredName": null}, "kernelRegularizer": null, "biasRegularizer": null, "activityRegularizer": null, "kernelConstraint": null, "biasConstraint": null}, "name": "block_4_project", "inboundNodes": [{"args": [{"className": "__keras_tensor__", "config": {"shape": [null, 28, 28, 192], "dtype": "float32", "kerasHistory": ["block_4_depthwise_relu", 0, 0]}}], "kwargs": {}}]}, {"className": "BatchNormalization", "config": {"name": "block_4_project_BN", "trainable": false, "dtype": {"module": "keras", "className": "DTypePolicy", "config": {"name": "float32"}, "registeredName": null}, "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "betaInitializer": {"module": "keras.initializers", "className": "Zeros", "config": {}, "registeredName": null}, "gammaInitializer": {"module": "keras.initializers", "className": "Ones", "config": {}, "registeredName": null}, "movingMeanInitializer": {"module": "keras.initializers", "className": "Zeros", "config": {}, "registeredName": null}, "movingVarianceInitializer": {"module": "keras.initializers", "className": "Ones", "config": {}, "registeredName": null}, "betaRegularizer": null, "gammaRegularizer": null, "betaConstraint": null, "gammaConstraint": null, "synchronized": false}, "name": "block_4_project_BN", "inboundNodes": [{"args": [{"className": "__keras_tensor__", "config": {"shape": [null, 28, 28, 32], "dtype": "float32", "kerasHistory": ["block_4_project", 0, 0]}}], "kwargs": {"mask": null}}]}, {"className": "Add", "config": {"name": "block_4_add", "trainable": false, "dtype": {"module": "keras", "className": "DTypePolicy", "config": {"name": "float32"}, "registeredName": null}}, "name": "block_4_add", "inboundNodes": [{"args": [[{"className": "__keras_tensor__", "config": {"shape": [null, 28, 28, 32], "dtype": "float32", "kerasHistory": ["block_3_project_BN", 0, 0]}}, {"className": "__keras_tensor__", "config": {"shape": [null, 28, 28, 32], "dtype": "float32", "kerasHistory": ["block_4_project_BN", 0, 0]}}]], "kwargs": {}}]}, {"className": "Conv2D", "config": {"name": "block_5_expand", "trainable": false, "dtype": {"module": "keras", "className": "DTypePolicy", "config": {"name": "float32"}, "registeredName": null}, "filters": 192, "kernelSize": [1, 1], "strides": [1, 1], "padding": "same", "dataFormat": "channels_last", "dilationRate": [1, 1], "groups": 1, "activation": "linear", "useBias": false, "kernelInitializer": {"module": "keras.initializers", "className": "GlorotUniform", "config": {"seed": null}, "registeredName": null}, "biasInitializer": {"module": "keras.initializers", "className": "Zeros", "config": {}, "registeredName": null}, "kernelRegularizer": null, "biasRegularizer": null, "activityRegularizer": null, "kernelConstraint": null, "biasConstraint": null}, "name": "block_5_expand", "inboundNodes": [{"args": [{"className": "__keras_tensor__", "config": {"shape": [null, 28, 28, 32], "dtype": "float32", "kerasHistory": ["block_4_add", 0, 0]}}], "kwargs": {}}]}, {"className": "BatchNormalization", "config": {"name": "block_5_expand_BN", "trainable": false, "dtype": {"module": "keras", "className": "DTypePolicy", "config": {"name": "float32"}, "registeredName": null}, "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "betaInitializer": {"module": "keras.initializers", "className": "Zeros", "config": {}, "registeredName": null}, "gammaInitializer": {"module": "keras.initializers", "className": "Ones", "config": {}, "registeredName": null}, "movingMeanInitializer": {"module": "keras.initializers", "className": "Zeros", "config": {}, "registeredName": null}, "movingVarianceInitializer": {"module": "keras.initializers", "className": "Ones", "config": {}, "registeredName": null}, "betaRegularizer": null, "gammaRegularizer": null, "betaConstraint": null, "gammaConstraint": null, "synchronized": false}, "name": "block_5_expand_BN", "inboundNodes": [{"args": [{"className": "__keras_tensor__", "config": {"shape": [null, 28, 28, 192], "dtype": "float32", "kerasHistory": ["block_5_expand", 0, 0]}}], "kwargs": {"mask": null}}]}, {"className": "ReLU", "config": {"name": "block_5_expand_relu", "trainable": false, "dtype": {"module": "keras", "className": "DTypePolicy", "config": {"name": "float32"}, "registeredName": null}, "maxValue": 6.0, "negativeSlope": 0.0, "threshold": 0.0}, "name": "block_5_expand_relu", "inboundNodes": [{"args": [{"className": "__keras_tensor__", "config": {"shape": [null, 28, 28, 192], "dtype": "float32", "kerasHistory": ["block_5_expand_BN", 0, 0]}}], "kwargs": {}}]}, {"className": "DepthwiseConv2D", "config": {"name": "block_5_depthwise", "trainable": false, "dtype": {"module": "keras", "className": "DTypePolicy", "config": {"name": "float32"}, "registeredName": null}, "depthMultiplier": 1, "kernelSize": [3, 3], "strides": [1, 1], "padding": "same", "dataFormat": "channels_last", "dilationRate": [1, 1], "activation": "linear", "useBias": false, "depthwiseInitializer": {"module": "keras.initializers", "className": "GlorotUniform", "config": {"seed": null}, "registeredName": null}, "biasInitializer": {"module": "keras.initializers", "className": "Zeros", "config": {}, "registeredName": null}, "depthwiseRegularizer": null, "biasRegularizer": null, "activityRegularizer": null, "depthwiseConstraint": null, "biasConstraint": null}, "name": "block_5_depthwise", "inboundNodes": [{"args": [{"className": "__keras_tensor__", "config": {"shape": [null, 28, 28, 192], "dtype": "float32", "kerasHistory": ["block_5_expand_relu", 0, 0]}}], "kwargs": {}}]}, {"className": "BatchNormalization", "config": {"name": "block_5_depthwise_BN", "trainable": false, "dtype": {"module": "keras", "className": "DTypePolicy", "config": {"name": "float32"}, "registeredName": null}, "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "betaInitializer": {"module": "keras.initializers", "className": "Zeros", "config": {}, "registeredName": null}, "gammaInitializer": {"module": "keras.initializers", "className": "Ones", "config": {}, "registeredName": null}, "movingMeanInitializer": {"module": "keras.initializers", "className": "Zeros", "config": {}, "registeredName": null}, "movingVarianceInitializer": {"module": "keras.initializers", "className": "Ones", "config": {}, "registeredName": null}, "betaRegularizer": null, "gammaRegularizer": null, "betaConstraint": null, "gammaConstraint": null, "synchronized": false}, "name": "block_5_depthwise_BN", "inboundNodes": [{"args": [{"className": "__keras_tensor__", "config": {"shape": [null, 28, 28, 192], "dtype": "float32", "kerasHistory": ["block_5_depthwise", 0, 0]}}], "kwargs": {"mask": null}}]}, {"className": "ReLU", "config": {"name": "block_5_depthwise_relu", "trainable": false, "dtype": {"module": "keras", "className": "DTypePolicy", "config": {"name": "float32"}, "registeredName": null}, "maxValue": 6.0, "negativeSlope": 0.0, "threshold": 0.0}, "name": "block_5_depthwise_relu", "inboundNodes": [{"args": [{"className": "__keras_tensor__", "config": {"shape": [null, 28, 28, 192], "dtype": "float32", "kerasHistory": ["block_5_depthwise_BN", 0, 0]}}], "kwargs": {}}]}, {"className": "Conv2D", "config": {"name": "block_5_project", "trainable": false, "dtype": {"module": "keras", "className": "DTypePolicy", "config": {"name": "float32"}, "registeredName": null}, "filters": 32, "kernelSize": [1, 1], "strides": [1, 1], "padding": "same", "dataFormat": "channels_last", "dilationRate": [1, 1], "groups": 1, "activation": "linear", "useBias": false, "kernelInitializer": {"module": "keras.initializers", "className": "GlorotUniform", "config": {"seed": null}, "registeredName": null}, "biasInitializer": {"module": "keras.initializers", "className": "Zeros", "config": {}, "registeredName": null}, "kernelRegularizer": null, "biasRegularizer": null, "activityRegularizer": null, "kernelConstraint": null, "biasConstraint": null}, "name": "block_5_project", "inboundNodes": [{"args": [{"className": "__keras_tensor__", "config": {"shape": [null, 28, 28, 192], "dtype": "float32", "kerasHistory": ["block_5_depthwise_relu", 0, 0]}}], "kwargs": {}}]}, {"className": "BatchNormalization", "config": {"name": "block_5_project_BN", "trainable": false, "dtype": {"module": "keras", "className": "DTypePolicy", "config": {"name": "float32"}, "registeredName": null}, "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "betaInitializer": {"module": "keras.initializers", "className": "Zeros", "config": {}, "registeredName": null}, "gammaInitializer": {"module": "keras.initializers", "className": "Ones", "config": {}, "registeredName": null}, "movingMeanInitializer": {"module": "keras.initializers", "className": "Zeros", "config": {}, "registeredName": null}, "movingVarianceInitializer": {"module": "keras.initializers", "className": "Ones", "config": {}, "registeredName": null}, "betaRegularizer": null, "gammaRegularizer": null, "betaConstraint": null, "gammaConstraint": null, "synchronized": false}, "name": "block_5_project_BN", "inboundNodes": [{"args": [{"className": "__keras_tensor__", "config": {"shape": [null, 28, 28, 32], "dtype": "float32", "kerasHistory": ["block_5_project", 0, 0]}}], "kwargs": {"mask": null}}]}, {"className": "Add", "config": {"name": "block_5_add", "trainable": false, "dtype": {"module": "keras", "className": "DTypePolicy", "config": {"name": "float32"}, "registeredName": null}}, "name": "block_5_add", "inboundNodes": [{"args": [[{"className": "__keras_tensor__", "config": {"shape": [null, 28, 28, 32], "dtype": "float32", "kerasHistory": ["block_4_add", 0, 0]}}, {"className": "__keras_tensor__", "config": {"shape": [null, 28, 28, 32], "dtype": "float32", "kerasHistory": ["block_5_project_BN", 0, 0]}}]], "kwargs": {}}]}, {"className": "Conv2D", "config": {"name": "block_6_expand", "trainable": true, "dtype": {"module": "keras", "className": "DTypePolicy", "config": {"name": "float32"}, "registeredName": null}, "filters": 192, "kernelSize": [1, 1], "strides": [1, 1], "padding": "same", "dataFormat": "channels_last", "dilationRate": [1, 1], "groups": 1, "activation": "linear", "useBias": false, "kernelInitializer": {"module": "keras.initializers", "className": "GlorotUniform", "config": {"seed": null}, "registeredName": null}, "biasInitializer": {"module": "keras.initializers", "className": "Zeros", "config": {}, "registeredName": null}, "kernelRegularizer": null, "biasRegularizer": null, "activityRegularizer": null, "kernelConstraint": null, "biasConstraint": null}, "name": "block_6_expand", "inboundNodes": [{"args": [{"className": "__keras_tensor__", "config": {"shape": [null, 28, 28, 32], "dtype": "float32", "kerasHistory": ["block_5_add", 0, 0]}}], "kwargs": {}}]}, {"className": "BatchNormalization", "config": {"name": "block_6_expand_BN", "trainable": true, "dtype": {"module": "keras", "className": "DTypePolicy", "config": {"name": "float32"}, "registeredName": null}, "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "betaInitializer": {"module": "keras.initializers", "className": "Zeros", "config": {}, "registeredName": null}, "gammaInitializer": {"module": "keras.initializers", "className": "Ones", "config": {}, "registeredName": null}, "movingMeanInitializer": {"module": "keras.initializers", "className": "Zeros", "config": {}, "registeredName": null}, "movingVarianceInitializer": {"module": "keras.initializers", "className": "Ones", "config": {}, "registeredName": null}, "betaRegularizer": null, "gammaRegularizer": null, "betaConstraint": null, "gammaConstraint": null, "synchronized": false}, "name": "block_6_expand_BN", "inboundNodes": [{"args": [{"className": "__keras_tensor__", "config": {"shape": [null, 28, 28, 192], "dtype": "float32", "kerasHistory": ["block_6_expand", 0, 0]}}], "kwargs": {"mask": null}}]}, {"className": "ReLU", "config": {"name": "block_6_expand_relu", "trainable": true, "dtype": {"module": "keras", "className": "DTypePolicy", "config": {"name": "float32"}, "registeredName": null}, "maxValue": 6.0, "negativeSlope": 0.0, "threshold": 0.0}, "name": "block_6_expand_relu", "inboundNodes": [{"args": [{"className": "__keras_tensor__", "config": {"shape": [null, 28, 28, 192], "dtype": "float32", "kerasHistory": ["block_6_expand_BN", 0, 0]}}], "kwargs": {}}]}, {"className": "ZeroPadding2D", "config": {"name": "block_6_pad", "trainable": true, "dtype": {"module": "keras", "className": "DTypePolicy", "config": {"name": "float32"}, "registeredName": null}, "padding": [[0, 1], [0, 1]], "dataFormat": "channels_last"}, "name": "block_6_pad", "inboundNodes": [{"args": [{"className": "__keras_tensor__", "config": {"shape": [null, 28, 28, 192], "dtype": "float32", "kerasHistory": ["block_6_expand_relu", 0, 0]}}], "kwargs": {}}]}, {"className": "DepthwiseConv2D", "config": {"name": "block_6_depthwise", "trainable": true, "dtype": {"module": "keras", "className": "DTypePolicy", "config": {"name": "float32"}, "registeredName": null}, "depthMultiplier": 1, "kernelSize": [3, 3], "strides": [2, 2], "padding": "valid", "dataFormat": "channels_last", "dilationRate": [1, 1], "activation": "linear", "useBias": false, "depthwiseInitializer": {"module": "keras.initializers", "className": "GlorotUniform", "config": {"seed": null}, "registeredName": null}, "biasInitializer": {"module": "keras.initializers", 