{"format": "layers-model", "generatedBy": "keras v3.10.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "modelTopology": {"keras_version": "3.10.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "functional_1", "trainable": true, "layers": [{"config": {"dtype": "float32", "sparse": false, "ragged": false, "name": "input_image", "batchInputShape": [null, 224, 224, 3]}, "name": "input_image", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"name": "Conv1", "trainable": false, "dtype": {"module": "keras", "config": {"name": "float32"}, "registeredName": null, "class_name": "DTypePolicy"}, "filters": 32, "strides": [2, 2], "padding": "same", "groups": 1, "activation": "linear", "useBias": false, "kernelInitializer": {"module": "keras.initializers", "config": {"seed": null}, "registeredName": null, "class_name": "GlorotUniform"}, "biasInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Zeros"}, "kernelRegularizer": null, "biasRegularizer": null, "activityRegularizer": null, "kernelConstraint": null, "biasConstraint": null, "kernelSize": [3, 3], "dilationRate": [1, 1], "dataFormat": "channels_last"}, "name": "Conv1", "class_name": "Conv2D", "inbound_nodes": [[["input_image", 0, 0]]]}, {"config": {"name": "bn_Conv1", "trainable": false, "dtype": {"module": "keras", "config": {"name": "float32"}, "registeredName": null, "class_name": "DTypePolicy"}, "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "betaInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Zeros"}, "gammaInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Ones"}, "movingMeanInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Zeros"}, "movingVarianceInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Ones"}, "betaRegularizer": null, "gammaRegularizer": null, "betaConstraint": null, "gammaConstraint": null, "synchronized": false}, "name": "bn_Conv1", "class_name": "BatchNormalization", "inbound_nodes": [[["Conv1", 0, 0]]]}, {"config": {"name": "Conv1_relu", "trainable": false, "dtype": {"module": "keras", "config": {"name": "float32"}, "registeredName": null, "class_name": "DTypePolicy"}, "threshold": 0.0, "maxValue": 6.0, "negativeSlope": 0.0}, "name": "Conv1_relu", "class_name": "ReLU", "inbound_nodes": [[["bn_Conv1", 0, 0]]]}, {"config": {"name": "expanded_conv_depthwise", "trainable": false, "dtype": {"module": "keras", "config": {"name": "float32"}, "registeredName": null, "class_name": "DTypePolicy"}, "strides": [1, 1], "padding": "same", "activation": "linear", "useBias": false, "depthwiseInitializer": {"module": "keras.initializers", "config": {"seed": null}, "registeredName": null, "class_name": "GlorotUniform"}, "biasInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Zeros"}, "depthwiseRegularizer": null, "biasRegularizer": null, "activityRegularizer": null, "depthwiseConstraint": null, "biasConstraint": null, "kernelSize": [3, 3], "dilationRate": [1, 1], "dataFormat": "channels_last", "depthMultiplier": 1}, "name": "expanded_conv_depthwise", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["Conv1_relu", 0, 0]]]}, {"config": {"name": "expanded_conv_depthwise_BN", "trainable": false, "dtype": {"module": "keras", "config": {"name": "float32"}, "registeredName": null, "class_name": "DTypePolicy"}, "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "betaInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Zeros"}, "gammaInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Ones"}, "movingMeanInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Zeros"}, "movingVarianceInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Ones"}, "betaRegularizer": null, "gammaRegularizer": null, "betaConstraint": null, "gammaConstraint": null, "synchronized": false}, "name": "expanded_conv_depthwise_BN", "class_name": "BatchNormalization", "inbound_nodes": [[["expanded_conv_depthwise", 0, 0]]]}, {"config": {"name": "expanded_conv_depthwise_relu", "trainable": false, "dtype": {"module": "keras", "config": {"name": "float32"}, "registeredName": null, "class_name": "DTypePolicy"}, "threshold": 0.0, "maxValue": 6.0, "negativeSlope": 0.0}, "name": "expanded_conv_depthwise_relu", "class_name": "ReLU", "inbound_nodes": [[["expanded_conv_depthwise_BN", 0, 0]]]}, {"config": {"name": "expanded_conv_project", "trainable": false, "dtype": {"module": "keras", "config": {"name": "float32"}, "registeredName": null, "class_name": "DTypePolicy"}, "filters": 16, "strides": [1, 1], "padding": "same", "groups": 1, "activation": "linear", "useBias": false, "kernelInitializer": {"module": "keras.initializers", "config": {"seed": null}, "registeredName": null, "class_name": "GlorotUniform"}, "biasInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Zeros"}, "kernelRegularizer": null, "biasRegularizer": null, "activityRegularizer": null, "kernelConstraint": null, "biasConstraint": null, "kernelSize": [1, 1], "dilationRate": [1, 1], "dataFormat": "channels_last"}, "name": "expanded_conv_project", "class_name": "Conv2D", "inbound_nodes": [[["expanded_conv_depthwise_relu", 0, 0]]]}, {"config": {"name": "expanded_conv_project_BN", "trainable": false, "dtype": {"module": "keras", "config": {"name": "float32"}, "registeredName": null, "class_name": "DTypePolicy"}, "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "betaInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Zeros"}, "gammaInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Ones"}, "movingMeanInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Zeros"}, "movingVarianceInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Ones"}, "betaRegularizer": null, "gammaRegularizer": null, "betaConstraint": null, "gammaConstraint": null, "synchronized": false}, "name": "expanded_conv_project_BN", "class_name": "BatchNormalization", "inbound_nodes": [[["expanded_conv_project", 0, 0]]]}, {"config": {"name": "block_1_expand", "trainable": false, "dtype": {"module": "keras", "config": {"name": "float32"}, "registeredName": null, "class_name": "DTypePolicy"}, "filters": 96, "strides": [1, 1], "padding": "same", "groups": 1, "activation": "linear", "useBias": false, "kernelInitializer": {"module": "keras.initializers", "config": {"seed": null}, "registeredName": null, "class_name": "GlorotUniform"}, "biasInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Zeros"}, "kernelRegularizer": null, "biasRegularizer": null, "activityRegularizer": null, "kernelConstraint": null, "biasConstraint": null, "kernelSize": [1, 1], "dilationRate": [1, 1], "dataFormat": "channels_last"}, "name": "block_1_expand", "class_name": "Conv2D", "inbound_nodes": [[["expanded_conv_project_BN", 0, 0]]]}, {"config": {"name": "block_1_expand_BN", "trainable": false, "dtype": {"module": "keras", "config": {"name": "float32"}, "registeredName": null, "class_name": "DTypePolicy"}, "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "betaInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Zeros"}, "gammaInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Ones"}, "movingMeanInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Zeros"}, "movingVarianceInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Ones"}, "betaRegularizer": null, "gammaRegularizer": null, "betaConstraint": null, "gammaConstraint": null, "synchronized": false}, "name": "block_1_expand_BN", "class_name": "BatchNormalization", "inbound_nodes": [[["block_1_expand", 0, 0]]]}, {"config": {"name": "block_1_expand_relu", "trainable": false, "dtype": {"module": "keras", "config": {"name": "float32"}, "registeredName": null, "class_name": "DTypePolicy"}, "threshold": 0.0, "maxValue": 6.0, "negativeSlope": 0.0}, "name": "block_1_expand_relu", "class_name": "ReLU", "inbound_nodes": [[["block_1_expand_BN", 0, 0]]]}, {"config": {"name": "block_1_pad", "trainable": false, "dtype": {"module": "keras", "config": {"name": "float32"}, "registeredName": null, "class_name": "DTypePolicy"}, "padding": [[0, 1], [0, 1]], "dataFormat": "channels_last"}, "name": "block_1_pad", "class_name": "ZeroPadding2D", "inbound_nodes": [[["block_1_expand_relu", 0, 0]]]}, {"config": {"name": "block_1_depthwise", "trainable": false, "dtype": {"module": "keras", "config": {"name": "float32"}, "registeredName": null, "class_name": "DTypePolicy"}, "strides": [2, 2], "padding": "valid", "activation": "linear", "useBias": false, "depthwiseInitializer": {"module": "keras.initializers", "config": {"seed": null}, "registeredName": null, "class_name": "GlorotUniform"}, "biasInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Zeros"}, "depthwiseRegularizer": null, "biasRegularizer": null, "activityRegularizer": null, "depthwiseConstraint": null, "biasConstraint": null, "kernelSize": [3, 3], "dilationRate": [1, 1], "dataFormat": "channels_last", "depthMultiplier": 1}, "name": "block_1_depthwise", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["block_1_pad", 0, 0]]]}, {"config": {"name": "block_1_depthwise_BN", "trainable": false, "dtype": {"module": "keras", "config": {"name": "float32"}, "registeredName": null, "class_name": "DTypePolicy"}, "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "betaInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Zeros"}, "gammaInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Ones"}, "movingMeanInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Zeros"}, "movingVarianceInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Ones"}, "betaRegularizer": null, "gammaRegularizer": null, "betaConstraint": null, "gammaConstraint": null, "synchronized": false}, "name": "block_1_depthwise_BN", "class_name": "BatchNormalization", "inbound_nodes": [[["block_1_depthwise", 0, 0]]]}, {"config": {"name": "block_1_depthwise_relu", "trainable": false, "dtype": {"module": "keras", "config": {"name": "float32"}, "registeredName": null, "class_name": "DTypePolicy"}, "threshold": 0.0, "maxValue": 6.0, "negativeSlope": 0.0}, "name": "block_1_depthwise_relu", "class_name": "ReLU", "inbound_nodes": [[["block_1_depthwise_BN", 0, 0]]]}, {"config": {"name": "block_1_project", "trainable": false, "dtype": {"module": "keras", "config": {"name": "float32"}, "registeredName": null, "class_name": "DTypePolicy"}, "filters": 24, "strides": [1, 1], "padding": "same", "groups": 1, "activation": "linear", "useBias": false, "kernelInitializer": {"module": "keras.initializers", "config": {"seed": null}, "registeredName": null, "class_name": "GlorotUniform"}, "biasInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Zeros"}, "kernelRegularizer": null, "biasRegularizer": null, "activityRegularizer": null, "kernelConstraint": null, "biasConstraint": null, "kernelSize": [1, 1], "dilationRate": [1, 1], "dataFormat": "channels_last"}, "name": "block_1_project", "class_name": "Conv2D", "inbound_nodes": [[["block_1_depthwise_relu", 0, 0]]]}, {"config": {"name": "block_1_project_BN", "trainable": false, "dtype": {"module": "keras", "config": {"name": "float32"}, "registeredName": null, "class_name": "DTypePolicy"}, "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "betaInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Zeros"}, "gammaInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Ones"}, "movingMeanInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Zeros"}, "movingVarianceInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Ones"}, "betaRegularizer": null, "gammaRegularizer": null, "betaConstraint": null, "gammaConstraint": null, "synchronized": false}, "name": "block_1_project_BN", "class_name": "BatchNormalization", "inbound_nodes": [[["block_1_project", 0, 0]]]}, {"config": {"name": "block_2_expand", "trainable": false, "dtype": {"module": "keras", "config": {"name": "float32"}, "registeredName": null, "class_name": "DTypePolicy"}, "filters": 144, "strides": [1, 1], "padding": "same", "groups": 1, "activation": "linear", "useBias": false, "kernelInitializer": {"module": "keras.initializers", "config": {"seed": null}, "registeredName": null, "class_name": "GlorotUniform"}, "biasInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Zeros"}, "kernelRegularizer": null, "biasRegularizer": null, "activityRegularizer": null, "kernelConstraint": null, "biasConstraint": null, "kernelSize": [1, 1], "dilationRate": [1, 1], "dataFormat": "channels_last"}, "name": "block_2_expand", "class_name": "Conv2D", "inbound_nodes": [[["block_1_project_BN", 0, 0]]]}, {"config": {"name": "block_2_expand_BN", "trainable": false, "dtype": {"module": "keras", "config": {"name": "float32"}, "registeredName": null, "class_name": "DTypePolicy"}, "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "betaInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Zeros"}, "gammaInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Ones"}, "movingMeanInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Zeros"}, "movingVarianceInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Ones"}, "betaRegularizer": null, "gammaRegularizer": null, "betaConstraint": null, "gammaConstraint": null, "synchronized": false}, "name": "block_2_expand_BN", "class_name": "BatchNormalization", "inbound_nodes": [[["block_2_expand", 0, 0]]]}, {"config": {"name": "block_2_expand_relu", "trainable": false, "dtype": {"module": "keras", "config": {"name": "float32"}, "registeredName": null, "class_name": "DTypePolicy"}, "threshold": 0.0, "maxValue": 6.0, "negativeSlope": 0.0}, "name": "block_2_expand_relu", "class_name": "ReLU", "inbound_nodes": [[["block_2_expand_BN", 0, 0]]]}, {"config": {"name": "block_2_depthwise", "trainable": false, "dtype": {"module": "keras", "config": {"name": "float32"}, "registeredName": null, "class_name": "DTypePolicy"}, "strides": [1, 1], "padding": "same", "activation": "linear", "useBias": false, "depthwiseInitializer": {"module": "keras.initializers", "config": {"seed": null}, "registeredName": null, "class_name": "GlorotUniform"}, "biasInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Zeros"}, "depthwiseRegularizer": null, "biasRegularizer": null, "activityRegularizer": null, "depthwiseConstraint": null, "biasConstraint": null, "kernelSize": [3, 3], "dilationRate": [1, 1], "dataFormat": "channels_last", "depthMultiplier": 1}, "name": "block_2_depthwise", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["block_2_expand_relu", 0, 0]]]}, {"config": {"name": "block_2_depthwise_BN", "trainable": false, "dtype": {"module": "keras", "config": {"name": "float32"}, "registeredName": null, "class_name": "DTypePolicy"}, "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "betaInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Zeros"}, "gammaInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Ones"}, "movingMeanInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Zeros"}, "movingVarianceInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Ones"}, "betaRegularizer": null, "gammaRegularizer": null, "betaConstraint": null, "gammaConstraint": null, "synchronized": false}, "name": "block_2_depthwise_BN", "class_name": "BatchNormalization", "inbound_nodes": [[["block_2_depthwise", 0, 0]]]}, {"config": {"name": "block_2_depthwise_relu", "trainable": false, "dtype": {"module": "keras", "config": {"name": "float32"}, "registeredName": null, "class_name": "DTypePolicy"}, "threshold": 0.0, "maxValue": 6.0, "negativeSlope": 0.0}, "name": "block_2_depthwise_relu", "class_name": "ReLU", "inbound_nodes": [[["block_2_depthwise_BN", 0, 0]]]}, {"config": {"name": "block_2_project", "trainable": false, "dtype": {"module": "keras", "config": {"name": "float32"}, "registeredName": null, "class_name": "DTypePolicy"}, "filters": 24, "strides": [1, 1], "padding": "same", "groups": 1, "activation": "linear", "useBias": false, "kernelInitializer": {"module": "keras.initializers", "config": {"seed": null}, "registeredName": null, "class_name": "GlorotUniform"}, "biasInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Zeros"}, "kernelRegularizer": null, "biasRegularizer": null, "activityRegularizer": null, "kernelConstraint": null, "biasConstraint": null, "kernelSize": [1, 1], "dilationRate": [1, 1], "dataFormat": "channels_last"}, "name": "block_2_project", "class_name": "Conv2D", "inbound_nodes": [[["block_2_depthwise_relu", 0, 0]]]}, {"config": {"name": "block_2_project_BN", "trainable": false, "dtype": {"module": "keras", "config": {"name": "float32"}, "registeredName": null, "class_name": "DTypePolicy"}, "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "betaInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Zeros"}, "gammaInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Ones"}, "movingMeanInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Zeros"}, "movingVarianceInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Ones"}, "betaRegularizer": null, "gammaRegularizer": null, "betaConstraint": null, "gammaConstraint": null, "synchronized": false}, "name": "block_2_project_BN", "class_name": "BatchNormalization", "inbound_nodes": [[["block_2_project", 0, 0]]]}, {"config": {"name": "block_2_add", "trainable": false, "dtype": {"module": "keras", "config": {"name": "float32"}, "registeredName": null, "class_name": "DTypePolicy"}}, "name": "block_2_add", "class_name": "Add", "inbound_nodes": [[["block_1_project_BN", 0, 0], ["block_2_project_BN", 0, 0]]]}, {"config": {"name": "block_3_expand", "trainable": false, "dtype": {"module": "keras", "config": {"name": "float32"}, "registeredName": null, "class_name": "DTypePolicy"}, "filters": 144, "strides": [1, 1], "padding": "same", "groups": 1, "activation": "linear", "useBias": false, "kernelInitializer": {"module": "keras.initializers", "config": {"seed": null}, "registeredName": null, "class_name": "GlorotUniform"}, "biasInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Zeros"}, "kernelRegularizer": null, "biasRegularizer": null, "activityRegularizer": null, "kernelConstraint": null, "biasConstraint": null, "kernelSize": [1, 1], "dilationRate": [1, 1], "dataFormat": "channels_last"}, "name": "block_3_expand", "class_name": "Conv2D", "inbound_nodes": [[["block_2_add", 0, 0]]]}, {"config": {"name": "block_3_expand_BN", "trainable": false, "dtype": {"module": "keras", "config": {"name": "float32"}, "registeredName": null, "class_name": "DTypePolicy"}, "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "betaInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Zeros"}, "gammaInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Ones"}, "movingMeanInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Zeros"}, "movingVarianceInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Ones"}, "betaRegularizer": null, "gammaRegularizer": null, "betaConstraint": null, "gammaConstraint": null, "synchronized": false}, "name": "block_3_expand_BN", "class_name": "BatchNormalization", "inbound_nodes": [[["block_3_expand", 0, 0]]]}, {"config": {"name": "block_3_expand_relu", "trainable": false, "dtype": {"module": "keras", "config": {"name": "float32"}, "registeredName": null, "class_name": "DTypePolicy"}, "threshold": 0.0, "maxValue": 6.0, "negativeSlope": 0.0}, "name": "block_3_expand_relu", "class_name": "ReLU", "inbound_nodes": [[["block_3_expand_BN", 0, 0]]]}, {"config": {"name": "block_3_pad", "trainable": false, "dtype": {"module": "keras", "config": {"name": "float32"}, "registeredName": null, "class_name": "DTypePolicy"}, "padding": [[0, 1], [0, 1]], "dataFormat": "channels_last"}, "name": "block_3_pad", "class_name": "ZeroPadding2D", "inbound_nodes": [[["block_3_expand_relu", 0, 0]]]}, {"config": {"name": "block_3_depthwise", "trainable": false, "dtype": {"module": "keras", "config": {"name": "float32"}, "registeredName": null, "class_name": "DTypePolicy"}, "strides": [2, 2], "padding": "valid", "activation": "linear", "useBias": false, "depthwiseInitializer": {"module": "keras.initializers", "config": {"seed": null}, "registeredName": null, "class_name": "GlorotUniform"}, "biasInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Zeros"}, "depthwiseRegularizer": null, "biasRegularizer": null, "activityRegularizer": null, "depthwiseConstraint": null, "biasConstraint": null, "kernelSize": [3, 3], "dilationRate": [1, 1], "dataFormat": "channels_last", "depthMultiplier": 1}, "name": "block_3_depthwise", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["block_3_pad", 0, 0]]]}, {"config": {"name": "block_3_depthwise_BN", "trainable": false, "dtype": {"module": "keras", "config": {"name": "float32"}, "registeredName": null, "class_name": "DTypePolicy"}, "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "betaInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Zeros"}, "gammaInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Ones"}, "movingMeanInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Zeros"}, "movingVarianceInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Ones"}, "betaRegularizer": null, "gammaRegularizer": null, "betaConstraint": null, "gammaConstraint": null, "synchronized": false}, "name": "block_3_depthwise_BN", "class_name": "BatchNormalization", "inbound_nodes": [[["block_3_depthwise", 0, 0]]]}, {"config": {"name": "block_3_depthwise_relu", "trainable": false, "dtype": {"module": "keras", "config": {"name": "float32"}, "registeredName": null, "class_name": "DTypePolicy"}, "threshold": 0.0, "maxValue": 6.0, "negativeSlope": 0.0}, "name": "block_3_depthwise_relu", "class_name": "ReLU", "inbound_nodes": [[["block_3_depthwise_BN", 0, 0]]]}, {"config": {"name": "block_3_project", "trainable": false, "dtype": {"module": "keras", "config": {"name": "float32"}, "registeredName": null, "class_name": "DTypePolicy"}, "filters": 32, "strides": [1, 1], "padding": "same", "groups": 1, "activation": "linear", "useBias": false, "kernelInitializer": {"module": "keras.initializers", "config": {"seed": null}, "registeredName": null, "class_name": "GlorotUniform"}, "biasInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Zeros"}, "kernelRegularizer": null, "biasRegularizer": null, "activityRegularizer": null, "kernelConstraint": null, "biasConstraint": null, "kernelSize": [1, 1], "dilationRate": [1, 1], "dataFormat": "channels_last"}, "name": "block_3_project", "class_name": "Conv2D", "inbound_nodes": [[["block_3_depthwise_relu", 0, 0]]]}, {"config": {"name": "block_3_project_BN", "trainable": false, "dtype": {"module": "keras", "config": {"name": "float32"}, "registeredName": null, "class_name": "DTypePolicy"}, "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "betaInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Zeros"}, "gammaInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Ones"}, "movingMeanInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Zeros"}, "movingVarianceInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Ones"}, "betaRegularizer": null, "gammaRegularizer": null, "betaConstraint": null, "gammaConstraint": null, "synchronized": false}, "name": "block_3_project_BN", "class_name": "BatchNormalization", "inbound_nodes": [[["block_3_project", 0, 0]]]}, {"config": {"name": "block_4_expand", "trainable": false, "dtype": {"module": "keras", "config": {"name": "float32"}, "registeredName": null, "class_name": "DTypePolicy"}, "filters": 192, "strides": [1, 1], "padding": "same", "groups": 1, "activation": "linear", "useBias": false, "kernelInitializer": {"module": "keras.initializers", "config": {"seed": null}, "registeredName": null, "class_name": "GlorotUniform"}, "biasInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Zeros"}, "kernelRegularizer": null, "biasRegularizer": null, "activityRegularizer": null, "kernelConstraint": null, "biasConstraint": null, "kernelSize": [1, 1], "dilationRate": [1, 1], "dataFormat": "channels_last"}, "name": "block_4_expand", "class_name": "Conv2D", "inbound_nodes": [[["block_3_project_BN", 0, 0]]]}, {"config": {"name": "block_4_expand_BN", "trainable": false, "dtype": {"module": "keras", "config": {"name": "float32"}, "registeredName": null, "class_name": "DTypePolicy"}, "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "betaInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Zeros"}, "gammaInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Ones"}, "movingMeanInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Zeros"}, "movingVarianceInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Ones"}, "betaRegularizer": null, "gammaRegularizer": null, "betaConstraint": null, "gammaConstraint": null, "synchronized": false}, "name": "block_4_expand_BN", "class_name": "BatchNormalization", "inbound_nodes": [[["block_4_expand", 0, 0]]]}, {"config": {"name": "block_4_expand_relu", "trainable": false, "dtype": {"module": "keras", "config": {"name": "float32"}, "registeredName": null, "class_name": "DTypePolicy"}, "threshold": 0.0, "maxValue": 6.0, "negativeSlope": 0.0}, "name": "block_4_expand_relu", "class_name": "ReLU", "inbound_nodes": [[["block_4_expand_BN", 0, 0]]]}, {"config": {"name": "block_4_depthwise", "trainable": false, "dtype": {"module": "keras", "config": {"name": "float32"}, "registeredName": null, "class_name": "DTypePolicy"}, "strides": [1, 1], "padding": "same", "activation": "linear", "useBias": false, "depthwiseInitializer": {"module": "keras.initializers", "config": {"seed": null}, "registeredName": null, "class_name": "GlorotUniform"}, "biasInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Zeros"}, "depthwiseRegularizer": null, "biasRegularizer": null, "activityRegularizer": null, "depthwiseConstraint": null, "biasConstraint": null, "kernelSize": [3, 3], "dilationRate": [1, 1], "dataFormat": "channels_last", "depthMultiplier": 1}, "name": "block_4_depthwise", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["block_4_expand_relu", 0, 0]]]}, {"config": {"name": "block_4_depthwise_BN", "trainable": false, "dtype": {"module": "keras", "config": {"name": "float32"}, "registeredName": null, "class_name": "DTypePolicy"}, "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "betaInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Zeros"}, "gammaInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Ones"}, "movingMeanInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Zeros"}, "movingVarianceInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Ones"}, "betaRegularizer": null, "gammaRegularizer": null, "betaConstraint": null, "gammaConstraint": null, "synchronized": false}, "name": "block_4_depthwise_BN", "class_name": "BatchNormalization", "inbound_nodes": [[["block_4_depthwise", 0, 0]]]}, {"config": {"name": "block_4_depthwise_relu", "trainable": false, "dtype": {"module": "keras", "config": {"name": "float32"}, "registeredName": null, "class_name": "DTypePolicy"}, "threshold": 0.0, "maxValue": 6.0, "negativeSlope": 0.0}, "name": "block_4_depthwise_relu", "class_name": "ReLU", "inbound_nodes": [[["block_4_depthwise_BN", 0, 0]]]}, {"config": {"name": "block_4_project", "trainable": false, "dtype": {"module": "keras", "config": {"name": "float32"}, "registeredName": null, "class_name": "DTypePolicy"}, "filters": 32, "strides": [1, 1], "padding": "same", "groups": 1, "activation": "linear", "useBias": false, "kernelInitializer": {"module": "keras.initializers", "config": {"seed": null}, "registeredName": null, "class_name": "GlorotUniform"}, "biasInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Zeros"}, "kernelRegularizer": null, "biasRegularizer": null, "activityRegularizer": null, "kernelConstraint": null, "biasConstraint": null, "kernelSize": [1, 1], "dilationRate": [1, 1], "dataFormat": "channels_last"}, "name": "block_4_project", "class_name": "Conv2D", "inbound_nodes": [[["block_4_depthwise_relu", 0, 0]]]}, {"config": {"name": "block_4_project_BN", "trainable": false, "dtype": {"module": "keras", "config": {"name": "float32"}, "registeredName": null, "class_name": "DTypePolicy"}, "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "betaInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Zeros"}, "gammaInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Ones"}, "movingMeanInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Zeros"}, "movingVarianceInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Ones"}, "betaRegularizer": null, "gammaRegularizer": null, "betaConstraint": null, "gammaConstraint": null, "synchronized": false}, "name": "block_4_project_BN", "class_name": "BatchNormalization", "inbound_nodes": [[["block_4_project", 0, 0]]]}, {"config": {"name": "block_4_add", "trainable": false, "dtype": {"module": "keras", "config": {"name": "float32"}, "registeredName": null, "class_name": "DTypePolicy"}}, "name": "block_4_add", "class_name": "Add", "inbound_nodes": [[["block_3_project_BN", 0, 0], ["block_4_project_BN", 0, 0]]]}, {"config": {"name": "block_5_expand", "trainable": false, "dtype": {"module": "keras", "config": {"name": "float32"}, "registeredName": null, "class_name": "DTypePolicy"}, "filters": 192, "strides": [1, 1], "padding": "same", "groups": 1, "activation": "linear", "useBias": false, "kernelInitializer": {"module": "keras.initializers", "config": {"seed": null}, "registeredName": null, "class_name": "GlorotUniform"}, "biasInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Zeros"}, "kernelRegularizer": null, "biasRegularizer": null, "activityRegularizer": null, "kernelConstraint": null, "biasConstraint": null, "kernelSize": [1, 1], "dilationRate": [1, 1], "dataFormat": "channels_last"}, "name": "block_5_expand", "class_name": "Conv2D", "inbound_nodes": [[["block_4_add", 0, 0]]]}, {"config": {"name": "block_5_expand_BN", "trainable": false, "dtype": {"module": "keras", "config": {"name": "float32"}, "registeredName": null, "class_name": "DTypePolicy"}, "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "betaInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Zeros"}, "gammaInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Ones"}, "movingMeanInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Zeros"}, "movingVarianceInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Ones"}, "betaRegularizer": null, "gammaRegularizer": null, "betaConstraint": null, "gammaConstraint": null, "synchronized": false}, "name": "block_5_expand_BN", "class_name": "BatchNormalization", "inbound_nodes": [[["block_5_expand", 0, 0]]]}, {"config": {"name": "block_5_expand_relu", "trainable": false, "dtype": {"module": "keras", "config": {"name": "float32"}, "registeredName": null, "class_name": "DTypePolicy"}, "threshold": 0.0, "maxValue": 6.0, "negativeSlope": 0.0}, "name": "block_5_expand_relu", "class_name": "ReLU", "inbound_nodes": [[["block_5_expand_BN", 0, 0]]]}, {"config": {"name": "block_5_depthwise", "trainable": false, "dtype": {"module": "keras", "config": {"name": "float32"}, "registeredName": null, "class_name": "DTypePolicy"}, "strides": [1, 1], "padding": "same", "activation": "linear", "useBias": false, "depthwiseInitializer": {"module": "keras.initializers", "config": {"seed": null}, "registeredName": null, "class_name": "GlorotUniform"}, "biasInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Zeros"}, "depthwiseRegularizer": null, "biasRegularizer": null, "activityRegularizer": null, "depthwiseConstraint": null, "biasConstraint": null, "kernelSize": [3, 3], "dilationRate": [1, 1], "dataFormat": "channels_last", "depthMultiplier": 1}, "name": "block_5_depthwise", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["block_5_expand_relu", 0, 0]]]}, {"config": {"name": "block_5_depthwise_BN", "trainable": false, "dtype": {"module": "keras", "config": {"name": "float32"}, "registeredName": null, "class_name": "DTypePolicy"}, "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "betaInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Zeros"}, "gammaInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Ones"}, "movingMeanInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Zeros"}, "movingVarianceInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Ones"}, "betaRegularizer": null, "gammaRegularizer": null, "betaConstraint": null, "gammaConstraint": null, "synchronized": false}, "name": "block_5_depthwise_BN", "class_name": "BatchNormalization", "inbound_nodes": [[["block_5_depthwise", 0, 0]]]}, {"config": {"name": "block_5_depthwise_relu", "trainable": false, "dtype": {"module": "keras", "config": {"name": "float32"}, "registeredName": null, "class_name": "DTypePolicy"}, "threshold": 0.0, "maxValue": 6.0, "negativeSlope": 0.0}, "name": "block_5_depthwise_relu", "class_name": "ReLU", "inbound_nodes": [[["block_5_depthwise_BN", 0, 0]]]}, {"config": {"name": "block_5_project", "trainable": false, "dtype": {"module": "keras", "config": {"name": "float32"}, "registeredName": null, "class_name": "DTypePolicy"}, "filters": 32, "strides": [1, 1], "padding": "same", "groups": 1, "activation": "linear", "useBias": false, "kernelInitializer": {"module": "keras.initializers", "config": {"seed": null}, "registeredName": null, "class_name": "GlorotUniform"}, "biasInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Zeros"}, "kernelRegularizer": null, "biasRegularizer": null, "activityRegularizer": null, "kernelConstraint": null, "biasConstraint": null, "kernelSize": [1, 1], "dilationRate": [1, 1], "dataFormat": "channels_last"}, "name": "block_5_project", "class_name": "Conv2D", "inbound_nodes": [[["block_5_depthwise_relu", 0, 0]]]}, {"config": {"name": "block_5_project_BN", "trainable": false, "dtype": {"module": "keras", "config": {"name": "float32"}, "registeredName": null, "class_name": "DTypePolicy"}, "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "betaInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Zeros"}, "gammaInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Ones"}, "movingMeanInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Zeros"}, "movingVarianceInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Ones"}, "betaRegularizer": null, "gammaRegularizer": null, "betaConstraint": null, "gammaConstraint": null, "synchronized": false}, "name": "block_5_project_BN", "class_name": "BatchNormalization", "inbound_nodes": [[["block_5_project", 0, 0]]]}, {"config": {"name": "block_5_add", "trainable": false, "dtype": {"module": "keras", "config": {"name": "float32"}, "registeredName": null, "class_name": "DTypePolicy"}}, "name": "block_5_add", "class_name": "Add", "inbound_nodes": [[["block_4_add", 0, 0], ["block_5_project_BN", 0, 0]]]}, {"config": {"name": "block_6_expand", "trainable": true, "dtype": {"module": "keras", "config": {"name": "float32"}, "registeredName": null, "class_name": "DTypePolicy"}, "filters": 192, "strides": [1, 1], "padding": "same", "groups": 1, "activation": "linear", "useBias": false, "kernelInitializer": {"module": "keras.initializers", "config": {"seed": null}, "registeredName": null, "class_name": "GlorotUniform"}, "biasInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Zeros"}, "kernelRegularizer": null, "biasRegularizer": null, "activityRegularizer": null, "kernelConstraint": null, "biasConstraint": null, "kernelSize": [1, 1], "dilationRate": [1, 1], "dataFormat": "channels_last"}, "name": "block_6_expand", "class_name": "Conv2D", "inbound_nodes": [[["block_5_add", 0, 0]]]}, {"config": {"name": "block_6_expand_BN", "trainable": true, "dtype": {"module": "keras", "config": {"name": "float32"}, "registeredName": null, "class_name": "DTypePolicy"}, "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "betaInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Zeros"}, "gammaInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Ones"}, "movingMeanInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Zeros"}, "movingVarianceInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Ones"}, "betaRegularizer": null, "gammaRegularizer": null, "betaConstraint": null, "gammaConstraint": null, "synchronized": false}, "name": "block_6_expand_BN", "class_name": "BatchNormalization", "inbound_nodes": [[["block_6_expand", 0, 0]]]}, {"config": {"name": "block_6_expand_relu", "trainable": true, "dtype": {"module": "keras", "config": {"name": "float32"}, "registeredName": null, "class_name": "DTypePolicy"}, "threshold": 0.0, "maxValue": 6.0, "negativeSlope": 0.0}, "name": "block_6_expand_relu", "class_name": "ReLU", "inbound_nodes": [[["block_6_expand_BN", 0, 0]]]}, {"config": {"name": "block_6_pad", "trainable": true, "dtype": {"module": "keras", "config": {"name": "float32"}, "registeredName": null, "class_name": "DTypePolicy"}, "padding": [[0, 1], [0, 1]], "dataFormat": "channels_last"}, "name": "block_6_pad", "class_name": "ZeroPadding2D", "inbound_nodes": [[["block_6_expand_relu", 0, 0]]]}, {"config": {"name": "block_6_depthwise", "trainable": true, "dtype": {"module": "keras", "config": {"name": "float32"}, "registeredName": null, "class_name": "DTypePolicy"}, "strides": [2, 2], "padding": "valid", "activation": "linear", "useBias": false, "depthwiseInitializer": {"module": "keras.initializers", "config": {"seed": null}, "registeredName": null, "class_name": "GlorotUniform"}, "biasInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Zeros"}, "depthwiseRegularizer": null, "biasRegularizer": null, "activityRegularizer": null, "depthwiseConstraint": null, "biasConstraint": null, "kernelSize": [3, 3], "dilationRate": [1, 1], "dataFormat": "channels_last", "depthMultiplier": 1}, "name": "block_6_depthwise", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["block_6_pad", 0, 0]]]}, {"config": {"name": "block_6_depthwise_BN", "trainable": true, "dtype": {"module": "keras", "config": {"name": "float32"}, "registeredName": null, "class_name": "DTypePolicy"}, "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "betaInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Zeros"}, "gammaInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Ones"}, "movingMeanInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Zeros"}, "movingVarianceInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Ones"}, "betaRegularizer": null, "gammaRegularizer": null, "betaConstraint": null, "gammaConstraint": null, "synchronized": false}, "name": "block_6_depthwise_BN", "class_name": "BatchNormalization", "inbound_nodes": [[["block_6_depthwise", 0, 0]]]}, {"config": {"name": "block_6_depthwise_relu", "trainable": true, "dtype": {"module": "keras", "config": {"name": "float32"}, "registeredName": null, "class_name": "DTypePolicy"}, "threshold": 0.0, "maxValue": 6.0, "negativeSlope": 0.0}, "name": "block_6_depthwise_relu", "class_name": "ReLU", "inbound_nodes": [[["block_6_depthwise_BN", 0, 0]]]}, {"config": {"name": "block_6_project", "trainable": true, "dtype": {"module": "keras", "config": {"name": "float32"}, "registeredName": null, "class_name": "DTypePolicy"}, "filters": 64, "strides": [1, 1], "padding": "same", "groups": 1, "activation": "linear", "useBias": false, "kernelInitializer": {"module": "keras.initializers", "config": {"seed": null}, "registeredName": null, "class_name": "GlorotUniform"}, "biasInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Zeros"}, "kernelRegularizer": null, "biasRegularizer": null, "activityRegularizer": null, "kernelConstraint": null, "biasConstraint": null, "kernelSize": [1, 1], "dilationRate": [1, 1], "dataFormat": "channels_last"}, "name": "block_6_project", "class_name": "Conv2D", "inbound_nodes": [[["block_6_depthwise_relu", 0, 0]]]}, {"config": {"name": "block_6_project_BN", "trainable": true, "dtype": {"module": "keras", "config": {"name": "float32"}, "registeredName": null, "class_name": "DTypePolicy"}, "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "betaInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Zeros"}, "gammaInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Ones"}, "movingMeanInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Zeros"}, "movingVarianceInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Ones"}, "betaRegularizer": null, "gammaRegularizer": null, "betaConstraint": null, "gammaConstraint": null, "synchronized": false}, "name": "block_6_project_BN", "class_name": "BatchNormalization", "inbound_nodes": [[["block_6_project", 0, 0]]]}, {"config": {"name": "block_7_expand", "trainable": true, "dtype": {"module": "keras", "config": {"name": "float32"}, "registeredName": null, "class_name": "DTypePolicy"}, "filters": 384, "strides": [1, 1], "padding": "same", "groups": 1, "activation": "linear", "useBias": false, "kernelInitializer": {"module": "keras.initializers", "config": {"seed": null}, "registeredName": null, "class_name": "GlorotUniform"}, "biasInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Zeros"}, "kernelRegularizer": null, "biasRegularizer": null, "activityRegularizer": null, "kernelConstraint": null, "biasConstraint": null, "kernelSize": [1, 1], "dilationRate": [1, 1], "dataFormat": "channels_last"}, "name": "block_7_expand", "class_name": "Conv2D", "inbound_nodes": [[["block_6_project_BN", 0, 0]]]}, {"config": {"name": "block_7_expand_BN", "trainable": true, "dtype": {"module": "keras", "config": {"name": "float32"}, "registeredName": null, "class_name": "DTypePolicy"}, "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "betaInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Zeros"}, "gammaInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Ones"}, "movingMeanInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Zeros"}, "movingVarianceInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Ones"}, "betaRegularizer": null, "gammaRegularizer": null, "betaConstraint": null, "gammaConstraint": null, "synchronized": false}, "name": "block_7_expand_BN", "class_name": "BatchNormalization", "inbound_nodes": [[["block_7_expand", 0, 0]]]}, {"config": {"name": "block_7_expand_relu", "trainable": true, "dtype": {"module": "keras", "config": {"name": "float32"}, "registeredName": null, "class_name": "DTypePolicy"}, "threshold": 0.0, "maxValue": 6.0, "negativeSlope": 0.0}, "name": "block_7_expand_relu", "class_name": "ReLU", "inbound_nodes": [[["block_7_expand_BN", 0, 0]]]}, {"config": {"name": "block_7_depthwise", "trainable": true, "dtype": {"module": "keras", "config": {"name": "float32"}, "registeredName": null, "class_name": "DTypePolicy"}, "strides": [1, 1], "padding": "same", "activation": "linear", "useBias": false, "depthwiseInitializer": {"module": "keras.initializers", "config": {"seed": null}, "registeredName": null, "class_name": "GlorotUniform"}, "biasInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Zeros"}, "depthwiseRegularizer": null, "biasRegularizer": null, "activityRegularizer": null, "depthwiseConstraint": null, "biasConstraint": null, "kernelSize": [3, 3], "dilationRate": [1, 1], "dataFormat": "channels_last", "depthMultiplier": 1}, "name": "block_7_depthwise", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["block_7_expand_relu", 0, 0]]]}, {"config": {"name": "block_7_depthwise_BN", "trainable": true, "dtype": {"module": "keras", "config": {"name": "float32"}, "registeredName": null, "class_name": "DTypePolicy"}, "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "betaInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Zeros"}, "gammaInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Ones"}, "movingMeanInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Zeros"}, "movingVarianceInitializer": {"module": "keras.initializers", "config": {}, "registeredName": null, "class_name": "Ones"}, "betaRegularizer": null, "gammaRegularizer": null, "betaConstraint": null, "gammaConstraint": null, "synchronized": false}, "name": "block_7_depthwise_BN", "class_name": "BatchNormalization", "inbound_nodes": [[["block_7_depthwise", 0, 0]]]}, {"config": {"name": "block_7_depthwise_relu", "trainable": true, "dtype": {"module": "keras", "config": {"name": "float32"}, "registeredName": null, "class_name": "DTypePolicy"}, "threshold": 0.0, "maxValue": 6.0, "negativeSlope": 0.0}, "name": "block_7_depthwise_relu", "class_name": "ReLU", "inbound_nodes": [[["block_7_depthwise_BN", 0, 0]]]}, {"config": {"name": "block_7_project", "trainable": true, "dtype": {"module": "keras", "config": {"name": "float32"}, "registeredName": null, "class_name": "DTypePolicy"}, "filters": 64, "strides": [1, 1], "padding": "same", "groups": 1, "activation": "linear", "useBias": false, "kernelInitializer": {"module": "keras.initializers", "config": {"seed": null}, "registeredName": null, 