{
	"format": "layers-model",
	"generatedBy": "keras v3.9.2",
	"convertedBy": "TensorFlow.js Converter v4.22.0",
	"modelTopology": {
		"keras_version": "3.9.2",
		"backend": "tensorflow",
		"model_config": {
			"class_name": "Functional",
			"config": {
				"name": "functional",
				"trainable": true,
				"layers": [
					{
						"class_name": "InputLayer",
						"config": {
							"batch_input_shape": [null, 224, 224, 3],
							"dtype": "float32",
							"sparse": false,
							"ragged": false,
							"name": "input_image"
						},
						"name": "input_image",
						"inbound_nodes": []
					},
					{
						"class_name": "Conv2D",
						"config": { "name": "Conv1", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "activation": "linear", "use_bias": false },
						"name": "Conv1",
						"inbound_nodes": [[["input_image", 0, 0]]]
					},
					{
						"class_name": "BatchNormalization",
						"config": { "name": "bn_Conv1", "axis": -1, "momentum": 0.999, "epsilon": 0.001 },
						"name": "bn_Conv1",
						"inbound_nodes": [[["Conv1", 0, 0]]]
					},
					{
						"class_name": "ReLU",
						"config": { "name": "Conv1_relu", "max_value": 6.0 },
						"name": "Conv1_relu",
						"inbound_nodes": [[["bn_Conv1", 0, 0]]]
					},
					{
						"class_name": "DepthwiseConv2D",
						"config": { "name": "expanded_conv_depthwise", "depth_multiplier": 1, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same" },
						"name": "expanded_conv_depthwise",
						"inbound_nodes": [[["Conv1_relu", 0, 0]]]
					},
					{
						"class_name": "BatchNormalization",
						"config": { "name": "expanded_conv_depthwise_BN" },
						"name": "expanded_conv_depthwise_BN",
						"inbound_nodes": [[["expanded_conv_depthwise", 0, 0]]]
					},
					{
						"class_name": "ReLU",
						"config": { "name": "expanded_conv_depthwise_relu", "max_value": 6.0 },
						"name": "expanded_conv_depthwise_relu",
						"inbound_nodes": [[["expanded_conv_depthwise_BN", 0, 0]]]
					},
					{
						"class_name": "Conv2D",
						"config": { "name": "expanded_conv_project", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1] },
						"name": "expanded_conv_project",
						"inbound_nodes": [[["expanded_conv_depthwise_relu", 0, 0]]]
					},
					{
						"class_name": "BatchNormalization",
						"config": { "name": "expanded_conv_project_BN" },
						"name": "expanded_conv_project_BN",
						"inbound_nodes": [[["expanded_conv_project", 0, 0]]]
					},
					{
						"class_name": "Conv2D",
						"config": { "name": "block_1_expand", "filters": 96, "kernel_size": [1, 1] },
						"name": "block_1_expand",
						"inbound_nodes": [[["expanded_conv_project_BN", 0, 0]]]
					},
					{
						"class_name": "BatchNormalization",
						"config": { "name": "block_1_expand_BN" },
						"name": "block_1_expand_BN",
						"inbound_nodes": [[["block_1_expand", 0, 0]]]
					},
					{
						"class_name": "ReLU",
						"config": { "name": "block_1_expand_relu", "max_value": 6.0 },
						"name": "block_1_expand_relu",
						"inbound_nodes": [[["block_1_expand_BN", 0, 0]]]
					},
					{
						"class_name": "ZeroPadding2D",
						"config": { "name": "block_1_pad", "padding": [[0, 1], [0, 1]] },
						"name": "block_1_pad",
						"inbound_nodes": [[["block_1_expand_relu", 0, 0]]]
					},
					{
						"class_name": "DepthwiseConv2D",
						"config": { "name": "block_1_depthwise", "kernel_size": [3, 3], "strides": [2, 2] },
						"name": "block_1_depthwise",
						"inbound_nodes": [[["block_1_pad", 0, 0]]]
					},
					{
						"class_name": "BatchNormalization",
						"config": { "name": "block_1_depthwise_BN" },
						"name": "block_1_depthwise_BN",
						"inbound_nodes": [[["block_1_depthwise", 0, 0]]]
					},
					{
						"class_name": "ReLU",
						"config": { "name": "block_1_depthwise_relu", "max_value": 6.0 },
						"name": "block_1_depthwise_relu",
						"inbound_nodes": [[["block_1_depthwise_BN", 0, 0]]]
					},
					{
						"class_name": "Conv2D",
						"config": { "name": "block_1_project", "filters": 24, "kernel_size": [1, 1] },
						"name": "block_1_project",
						"inbound_nodes": [[["block_1_depthwise_relu", 0, 0]]]
					},
					{
						"class_name": "BatchNormalization",
						"config": { "name": "block_1_project_BN" },
						"name": "block_1_project_BN",
						"inbound_nodes": [[["block_1_project", 0, 0]]]
					},
					{
						"class_name": "Conv2D",
						"config": { "name": "block_2_expand", "filters": 144, "kernel_size": [1, 1] },
						"name": "block_2_expand",
						"inbound_nodes": [[["block_1_project_BN", 0, 0]]]
					},
					{
						"class_name": "BatchNormalization",
						"config": { "name": "block_2_expand_BN" },
						"name": "block_2_expand_BN",
						"inbound_nodes": [[["block_2_expand", 0, 0]]]
					},
					{
						"class_name": "ReLU",
						"config": { "name": "block_2_expand_relu", "max_value": 6.0 },
						"name": "block_2_expand_relu",
						"inbound_nodes": [[["block_2_expand_BN", 0, 0]]]
					},
					{
						"class_name": "DepthwiseConv2D",
						"config": { "name": "block_2_depthwise", "kernel_size": [3, 3], "strides": [1, 1] },
						"name": "block_2_depthwise",
						"inbound_nodes": [[["block_2_expand_relu", 0, 0]]]
					},
					{
						"class_name": "BatchNormalization",
						"config": { "name": "block_2_depthwise_BN" },
						"name": "block_2_depthwise_BN",
						"inbound_nodes": [[["block_2_depthwise", 0, 0]]]
					},
					{
						"class_name": "ReLU",
						"config": { "name": "block_2_depthwise_relu", "max_value": 6.0 },
						"name": "block_2_depthwise_relu",
						"inbound_nodes": [[["block_2_depthwise_BN", 0, 0]]]
					},
					{
						"class_name": "Conv2D",
						"config": { "name": "block_2_project", "filters": 24, "kernel_size": [1, 1] },
						"name": "block_2_project",
						"inbound_nodes": [[["block_2_depthwise_relu", 0, 0]]]
					},
					{
						"class_name": "BatchNormalization",
						"config": { "name": "block_2_project_BN" },
						"name": "block_2_project_BN",
						"inbound_nodes": [[["block_2_project", 0, 0]]]
					},
					{
						"class_name": "Add",
						"config": { "name": "block_2_add" },
						"name": "block_2_add",
						"inbound_nodes": [[ ["block_1_project_BN", 0, 0], ["block_2_project_BN", 0, 0] ]]
					},
					{
						"class_name": "Conv2D",
						"config": { "name": "block_7_add" },
						"name": "block_7_add",
						"inbound_nodes": [[ ["block_6_project_BN", 0, 0], ["block_7_project_BN", 0, 0] ]]
					},
					{
						"class_name": "Conv2D",
						"config": { "name": "block_8_add" },
						"name": "block_8_add",
						"inbound_nodes": [[ ["block_7_add", 0, 0], ["block_8_project_BN", 0, 0] ]]
					},
					{
						"class_name": "Conv2D",
						"config": { "name": "block_9_add" },
						"name": "block_9_add",
						"inbound_nodes": [[ ["block_8_add", 0, 0], ["block_9_project_BN", 0, 0] ]]
					}
				],
				"input_layers": [["input_image", 0, 0]],
				"output_layers": [["dense", 0, 0]]
			}
		}
	}
}
